<html>
<head>
<title>Realizar un analisis experimental desde fichero</title>
<link rel=StyleSheet type="text/css" href="css/style.css" />
</head>
<body>
	<h1>Realizar un an&aacute;lisis experimental desde fichero</h1>
	<p>Una vez se accede al di&aacute;logo de análisis experimental,
		para hacer dicho an&aacute;lisis desde fichero es necesario disponer
		de un archivo con el formato adecuado:</p>
	<div id="format">
		<p>N:X</p>
		<p>T:Y0,Y1,Y2…</p>
		<p>C:Z0,Z1,Z2…</p>
	</div>
	<p>Cada una de las filas representa un par&aacute;metro para la
		realización del análisis, seguido de : y uno o varios números
		separados por ,:</p>
	<ul>
		<li>N es el n&uacute;mero de instancias y es un &uacute;nico
			n&uacute;mero positivo (X)</li>
		<li>T es el n&uacute;mero de tareas de cada instancia y es una
			lista de n&uacute;meros positivos (Y0, Y1, Y2…)</li>
		<li>C es la capacidad m&uacute;xima de cada instancia y es una
			lista de n&uacute;meros mayores que 3 (Z0, Z1, Z2…)</li>
	</ul>
	<p>Con un fichero de an&aacute;lisis correcto preparado solo es
		necesario pulsar el bot&oacute;n Cargar de la parte inferior del
		di&aacute;logo.</p>
	<p></p>
	<img src="img/analisisExperimental2.PNG">
	<p>Una vez accedida a la opci&oacute;n se desplegar&aacute; un
		di&aacute;logo donde el usuario podr&aacute; navegar por sus
		directorios y escoger el fichero a cargar. Para ello podr&aacute;:</p>
	<ul>
		<li>Escribir el nombre del fichero a cargar</li>
		<li>Seleccionar manualmente el fichero a cargar</li>
	</ul>
	<p></p>
	<img src="img/cargar2.PNG">
	<p>En caso de que el fichero seleccionado no exista, tenga una
		extensi&oacute;n inv&aacute;lida (distinta a txt) o tenga un formato
		inv&aacute;lido se informar&aacute; al usuario del error.</p>
	<p></p>
	<img src="img/analisisExperimental3.PNG">
	<p></p>
	<img src="img/analisisExperimental4.PNG">
	<p></p>
	<img src="img/analisisExperimental5.PNG">
	<p>Una vez cargado el an&aacute;lisis se procesar&aacute; (en
		función del n&uacute;mero de combinaciones puede llevar varios
		segundos) y al terminar se desplegar&aacute; un di&aacute;logo donde
		el usuario podr&aacute; navegar por sus directorios y escoger el
		nombre del fichero a guardar (no es necesario especificar la
		extensi&oacute;n, el sistema autom&aacute;ticamente asignar&aacute; la
		extensi&oacute;n xls al archivo creado). El fichero generado
		podr&aacute; visualizarse con cualquier software que soporte xls.</p>
	<p></p>
	<img src="img/AnalysisResults.PNG">
</body>
</html>