<html>
<head>
<title>Planificar instancias paso a paso</title>
<link rel=StyleSheet type="text/css" href="css/style.css" />
</head>
<body>
	<h1>Planificar instancias paso a paso</h1>
	<p>Para realizar una planificaci&oacute;n paso a paso pueden
		utilizarse los botones Anterior y Siguiente de la parte inferior
		central de la ventana principal y seleccionar una regla en el
		desplegable indicado por la etiqueta Regla en la parte inferior
		izquierda de la ventana principal</p>
	<ul>
		<li>Si se utiliza el bot&oacute;n Siguiente se llevar&aacute; a
			cabo la planificaci&oacute;n con todas las tareas planificadas hasta
			el momento m&aacute;s la siguiente tarea obtenida seg&uacute;n la
			planificaci&oacute;n para la regla escogida. Este bot&oacute;n
			est&aacute; habilitado por defecto y solo se deshabilita al llegar a
			una planificaci&oacute;n completa.</li>
		<li>Si se utiliza el bot&oacute;n Anterior se llevar&oacute; a
			cabo la planificaci&oacute;n con todas las tareas planificadas hasta
			el momento menos la &uacute;ltima tarea obtenida seg&uacute;n la
			planificaci&oacute;n para la regla escogida. Este bot&oacute;n
			est&aacute; deshabilitado por defecto y solo se habilita al llegar a
			pulsar los botones Siguiente o Final al menos una vez. El
			bot&oacute;n se deshabilita al llegar a una instancia sin planificar.</li>
	</ul>
	<p>La opci&oacute;n de modificar el valor del par&aacute;metro g
		solo est&aacute; disponible si la regla seleccionada previamente es
		ATC, y permite escoger valores entre 0.01 y 1.</p>
	<p>Tambi&eacute;n puede modificarse el valor num&eacute;rico especificado
		junto a la etiqueta Separaci&oacute;n entre marcas para escoger con
		que separaci&oacute;n inicial entre marcas de graduaci&oacute;n se desea
		visualizar la instancia al planificarla.</p>
	<p></p>
	<img src="img/planificarPasos1.PNG">
	<p>Cada vez que se planifique una nueva tarea se actualizar&aacute; el
		valor del tardiness, mostrado en la parte inferior derecha de la
		ventana principal.</p>
</body>
</html>